Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
X (InputLayer)                  [(None, None, 13)]   0                                            
__________________________________________________________________________________________________
conv1d (Conv1D)                 (None, None, 256)    3584        X[0][0]                          
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, None, 256)    1024        conv1d[0][0]                     
__________________________________________________________________________________________________
activation (Activation)         (None, None, 256)    0           batch_normalization[0][0]        
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, None, 256)    459008      activation[0][0]                 
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, None, 256)    459008      activation[0][0]                 
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, None, 256)    1024        conv1d_1[0][0]                   
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, None, 256)    1024        conv1d_2[0][0]                   
__________________________________________________________________________________________________
activation_1 (Activation)       (None, None, 256)    0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
activation_2 (Activation)       (None, None, 256)    0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
multiply (Multiply)             (None, None, 256)    0           activation_1[0][0]               
                                                                 activation_2[0][0]               
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, None, 256)    65792       multiply[0][0]                   
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, None, 256)    1024        conv1d_3[0][0]                   
__________________________________________________________________________________________________
activation_3 (Activation)       (None, None, 256)    0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
add (Add)                       (None, None, 256)    0           activation_3[0][0]               
                                                                 activation[0][0]                 
__________________________________________________________________________________________________
conv1d_5 (Conv1D)               (None, None, 256)    459008      add[0][0]                        
__________________________________________________________________________________________________
conv1d_6 (Conv1D)               (None, None, 256)    459008      add[0][0]                        
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, None, 256)    1024        conv1d_5[0][0]                   
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, None, 256)    1024        conv1d_6[0][0]                   
__________________________________________________________________________________________________
activation_5 (Activation)       (None, None, 256)    0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
activation_6 (Activation)       (None, None, 256)    0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
multiply_1 (Multiply)           (None, None, 256)    0           activation_5[0][0]               
                                                                 activation_6[0][0]               
__________________________________________________________________________________________________
conv1d_7 (Conv1D)               (None, None, 256)    65792       multiply_1[0][0]                 
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, None, 256)    1024        conv1d_7[0][0]                   
__________________________________________________________________________________________________
activation_7 (Activation)       (None, None, 256)    0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
add_1 (Add)                     (None, None, 256)    0           activation_7[0][0]               
                                                                 add[0][0]                        
__________________________________________________________________________________________________
conv1d_9 (Conv1D)               (None, None, 256)    459008      add_1[0][0]                      
__________________________________________________________________________________________________
conv1d_10 (Conv1D)              (None, None, 256)    459008      add_1[0][0]                      
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, None, 256)    1024        conv1d_9[0][0]                   
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, None, 256)    1024        conv1d_10[0][0]                  
__________________________________________________________________________________________________
activation_9 (Activation)       (None, None, 256)    0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
activation_10 (Activation)      (None, None, 256)    0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
multiply_2 (Multiply)           (None, None, 256)    0           activation_9[0][0]               
                                                                 activation_10[0][0]              
__________________________________________________________________________________________________
conv1d_11 (Conv1D)              (None, None, 256)    65792       multiply_2[0][0]                 
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, None, 256)    1024        conv1d_11[0][0]                  
__________________________________________________________________________________________________
activation_11 (Activation)      (None, None, 256)    0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
add_2 (Add)                     (None, None, 256)    0           activation_11[0][0]              
                                                                 add_1[0][0]                      
__________________________________________________________________________________________________
conv1d_13 (Conv1D)              (None, None, 256)    459008      add_2[0][0]                      
__________________________________________________________________________________________________
conv1d_14 (Conv1D)              (None, None, 256)    459008      add_2[0][0]                      
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, None, 256)    1024        conv1d_13[0][0]                  
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, None, 256)    1024        conv1d_14[0][0]                  
__________________________________________________________________________________________________
activation_13 (Activation)      (None, None, 256)    0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
activation_14 (Activation)      (None, None, 256)    0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
multiply_3 (Multiply)           (None, None, 256)    0           activation_13[0][0]              
                                                                 activation_14[0][0]              
__________________________________________________________________________________________________
conv1d_15 (Conv1D)              (None, None, 256)    65792       multiply_3[0][0]                 
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, None, 256)    1024        conv1d_15[0][0]                  
__________________________________________________________________________________________________
activation_15 (Activation)      (None, None, 256)    0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
add_3 (Add)                     (None, None, 256)    0           activation_15[0][0]              
                                                                 add_2[0][0]                      
__________________________________________________________________________________________________
conv1d_17 (Conv1D)              (None, None, 256)    459008      add_3[0][0]                      
__________________________________________________________________________________________________
conv1d_18 (Conv1D)              (None, None, 256)    459008      add_3[0][0]                      
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, None, 256)    1024        conv1d_17[0][0]                  
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, None, 256)    1024        conv1d_18[0][0]                  
__________________________________________________________________________________________________
activation_17 (Activation)      (None, None, 256)    0           batch_normalization_17[0][0]     
__________________________________________________________________________________________________
activation_18 (Activation)      (None, None, 256)    0           batch_normalization_18[0][0]     
__________________________________________________________________________________________________
multiply_4 (Multiply)           (None, None, 256)    0           activation_17[0][0]              
                                                                 activation_18[0][0]              
__________________________________________________________________________________________________
conv1d_19 (Conv1D)              (None, None, 256)    65792       multiply_4[0][0]                 
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, None, 256)    1024        conv1d_19[0][0]                  
__________________________________________________________________________________________________
activation_19 (Activation)      (None, None, 256)    0           batch_normalization_19[0][0]     
__________________________________________________________________________________________________
add_4 (Add)                     (None, None, 256)    0           activation_19[0][0]              
                                                                 add_3[0][0]                      
__________________________________________________________________________________________________
conv1d_21 (Conv1D)              (None, None, 256)    459008      add_4[0][0]                      
__________________________________________________________________________________________________
conv1d_22 (Conv1D)              (None, None, 256)    459008      add_4[0][0]                      
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, None, 256)    1024        conv1d_21[0][0]                  
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, None, 256)    1024        conv1d_22[0][0]                  
__________________________________________________________________________________________________
activation_21 (Activation)      (None, None, 256)    0           batch_normalization_21[0][0]     
__________________________________________________________________________________________________
activation_22 (Activation)      (None, None, 256)    0           batch_normalization_22[0][0]     
__________________________________________________________________________________________________
multiply_5 (Multiply)           (None, None, 256)    0           activation_21[0][0]              
                                                                 activation_22[0][0]              
__________________________________________________________________________________________________
conv1d_23 (Conv1D)              (None, None, 256)    65792       multiply_5[0][0]                 
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, None, 256)    1024        conv1d_23[0][0]                  
__________________________________________________________________________________________________
activation_23 (Activation)      (None, None, 256)    0           batch_normalization_23[0][0]     
__________________________________________________________________________________________________
add_5 (Add)                     (None, None, 256)    0           activation_23[0][0]              
                                                                 add_4[0][0]                      
__________________________________________________________________________________________________
conv1d_25 (Conv1D)              (None, None, 256)    459008      add_5[0][0]                      
__________________________________________________________________________________________________
conv1d_26 (Conv1D)              (None, None, 256)    459008      add_5[0][0]                      
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (None, None, 256)    1024        conv1d_25[0][0]                  
__________________________________________________________________________________________________
batch_normalization_26 (BatchNo (None, None, 256)    1024        conv1d_26[0][0]                  
__________________________________________________________________________________________________
activation_25 (Activation)      (None, None, 256)    0           batch_normalization_25[0][0]     
__________________________________________________________________________________________________
activation_26 (Activation)      (None, None, 256)    0           batch_normalization_26[0][0]     
__________________________________________________________________________________________________
multiply_6 (Multiply)           (None, None, 256)    0           activation_25[0][0]              
                                                                 activation_26[0][0]              
__________________________________________________________________________________________________
conv1d_27 (Conv1D)              (None, None, 256)    65792       multiply_6[0][0]                 
__________________________________________________________________________________________________
batch_normalization_27 (BatchNo (None, None, 256)    1024        conv1d_27[0][0]                  
__________________________________________________________________________________________________
activation_27 (Activation)      (None, None, 256)    0           batch_normalization_27[0][0]     
__________________________________________________________________________________________________
add_6 (Add)                     (None, None, 256)    0           activation_27[0][0]              
                                                                 add_5[0][0]                      
__________________________________________________________________________________________________
conv1d_29 (Conv1D)              (None, None, 256)    459008      add_6[0][0]                      
__________________________________________________________________________________________________
conv1d_30 (Conv1D)              (None, None, 256)    459008      add_6[0][0]                      
__________________________________________________________________________________________________
batch_normalization_29 (BatchNo (None, None, 256)    1024        conv1d_29[0][0]                  
__________________________________________________________________________________________________
batch_normalization_30 (BatchNo (None, None, 256)    1024        conv1d_30[0][0]                  
__________________________________________________________________________________________________
activation_29 (Activation)      (None, None, 256)    0           batch_normalization_29[0][0]     
__________________________________________________________________________________________________
activation_30 (Activation)      (None, None, 256)    0           batch_normalization_30[0][0]     
__________________________________________________________________________________________________
multiply_7 (Multiply)           (None, None, 256)    0           activation_29[0][0]              
                                                                 activation_30[0][0]              
__________________________________________________________________________________________________
conv1d_31 (Conv1D)              (None, None, 256)    65792       multiply_7[0][0]                 
__________________________________________________________________________________________________
batch_normalization_31 (BatchNo (None, None, 256)    1024        conv1d_31[0][0]                  
__________________________________________________________________________________________________
activation_31 (Activation)      (None, None, 256)    0           batch_normalization_31[0][0]     
__________________________________________________________________________________________________
add_7 (Add)                     (None, None, 256)    0           activation_31[0][0]              
                                                                 add_6[0][0]                      
__________________________________________________________________________________________________
conv1d_33 (Conv1D)              (None, None, 256)    459008      add_7[0][0]                      
__________________________________________________________________________________________________
conv1d_34 (Conv1D)              (None, None, 256)    459008      add_7[0][0]                      
__________________________________________________________________________________________________
batch_normalization_33 (BatchNo (None, None, 256)    1024        conv1d_33[0][0]                  
__________________________________________________________________________________________________
batch_normalization_34 (BatchNo (None, None, 256)    1024        conv1d_34[0][0]                  
__________________________________________________________________________________________________
activation_33 (Activation)      (None, None, 256)    0           batch_normalization_33[0][0]     
__________________________________________________________________________________________________
activation_34 (Activation)      (None, None, 256)    0           batch_normalization_34[0][0]     
__________________________________________________________________________________________________
multiply_8 (Multiply)           (None, None, 256)    0           activation_33[0][0]              
                                                                 activation_34[0][0]              
__________________________________________________________________________________________________
conv1d_35 (Conv1D)              (None, None, 256)    65792       multiply_8[0][0]                 
__________________________________________________________________________________________________
batch_normalization_35 (BatchNo (None, None, 256)    1024        conv1d_35[0][0]                  
__________________________________________________________________________________________________
activation_35 (Activation)      (None, None, 256)    0           batch_normalization_35[0][0]     
__________________________________________________________________________________________________
add_8 (Add)                     (None, None, 256)    0           activation_35[0][0]              
                                                                 add_7[0][0]                      
__________________________________________________________________________________________________
conv1d_37 (Conv1D)              (None, None, 256)    459008      add_8[0][0]                      
__________________________________________________________________________________________________
conv1d_38 (Conv1D)              (None, None, 256)    459008      add_8[0][0]                      
__________________________________________________________________________________________________
batch_normalization_37 (BatchNo (None, None, 256)    1024        conv1d_37[0][0]                  
__________________________________________________________________________________________________
batch_normalization_38 (BatchNo (None, None, 256)    1024        conv1d_38[0][0]                  
__________________________________________________________________________________________________
activation_37 (Activation)      (None, None, 256)    0           batch_normalization_37[0][0]     
__________________________________________________________________________________________________
activation_38 (Activation)      (None, None, 256)    0           batch_normalization_38[0][0]     
__________________________________________________________________________________________________
multiply_9 (Multiply)           (None, None, 256)    0           activation_37[0][0]              
                                                                 activation_38[0][0]              
__________________________________________________________________________________________________
conv1d_39 (Conv1D)              (None, None, 256)    65792       multiply_9[0][0]                 
__________________________________________________________________________________________________
batch_normalization_39 (BatchNo (None, None, 256)    1024        conv1d_39[0][0]                  
__________________________________________________________________________________________________
activation_39 (Activation)      (None, None, 256)    0           batch_normalization_39[0][0]     
__________________________________________________________________________________________________
add_9 (Add)                     (None, None, 256)    0           activation_39[0][0]              
                                                                 add_8[0][0]                      
__________________________________________________________________________________________________
conv1d_41 (Conv1D)              (None, None, 256)    459008      add_9[0][0]                      
__________________________________________________________________________________________________
conv1d_42 (Conv1D)              (None, None, 256)    459008      add_9[0][0]                      
__________________________________________________________________________________________________
batch_normalization_41 (BatchNo (None, None, 256)    1024        conv1d_41[0][0]                  
__________________________________________________________________________________________________
batch_normalization_42 (BatchNo (None, None, 256)    1024        conv1d_42[0][0]                  
__________________________________________________________________________________________________
activation_41 (Activation)      (None, None, 256)    0           batch_normalization_41[0][0]     
__________________________________________________________________________________________________
activation_42 (Activation)      (None, None, 256)    0           batch_normalization_42[0][0]     
__________________________________________________________________________________________________
multiply_10 (Multiply)          (None, None, 256)    0           activation_41[0][0]              
                                                                 activation_42[0][0]              
__________________________________________________________________________________________________
conv1d_43 (Conv1D)              (None, None, 256)    65792       multiply_10[0][0]                
__________________________________________________________________________________________________
batch_normalization_43 (BatchNo (None, None, 256)    1024        conv1d_43[0][0]                  
__________________________________________________________________________________________________
activation_43 (Activation)      (None, None, 256)    0           batch_normalization_43[0][0]     
__________________________________________________________________________________________________
add_10 (Add)                    (None, None, 256)    0           activation_43[0][0]              
                                                                 add_9[0][0]                      
__________________________________________________________________________________________________
conv1d_45 (Conv1D)              (None, None, 256)    459008      add_10[0][0]                     
__________________________________________________________________________________________________
conv1d_46 (Conv1D)              (None, None, 256)    459008      add_10[0][0]                     
__________________________________________________________________________________________________
batch_normalization_45 (BatchNo (None, None, 256)    1024        conv1d_45[0][0]                  
__________________________________________________________________________________________________
batch_normalization_46 (BatchNo (None, None, 256)    1024        conv1d_46[0][0]                  
__________________________________________________________________________________________________
activation_45 (Activation)      (None, None, 256)    0           batch_normalization_45[0][0]     
__________________________________________________________________________________________________
activation_46 (Activation)      (None, None, 256)    0           batch_normalization_46[0][0]     
__________________________________________________________________________________________________
multiply_11 (Multiply)          (None, None, 256)    0           activation_45[0][0]              
                                                                 activation_46[0][0]              
__________________________________________________________________________________________________
conv1d_47 (Conv1D)              (None, None, 256)    65792       multiply_11[0][0]                
__________________________________________________________________________________________________
batch_normalization_47 (BatchNo (None, None, 256)    1024        conv1d_47[0][0]                  
__________________________________________________________________________________________________
activation_47 (Activation)      (None, None, 256)    0           batch_normalization_47[0][0]     
__________________________________________________________________________________________________
add_11 (Add)                    (None, None, 256)    0           activation_47[0][0]              
                                                                 add_10[0][0]                     
__________________________________________________________________________________________________
conv1d_49 (Conv1D)              (None, None, 256)    459008      add_11[0][0]                     
__________________________________________________________________________________________________
conv1d_50 (Conv1D)              (None, None, 256)    459008      add_11[0][0]                     
__________________________________________________________________________________________________
batch_normalization_49 (BatchNo (None, None, 256)    1024        conv1d_49[0][0]                  
__________________________________________________________________________________________________
batch_normalization_50 (BatchNo (None, None, 256)    1024        conv1d_50[0][0]                  
__________________________________________________________________________________________________
activation_49 (Activation)      (None, None, 256)    0           batch_normalization_49[0][0]     
__________________________________________________________________________________________________
activation_50 (Activation)      (None, None, 256)    0           batch_normalization_50[0][0]     
__________________________________________________________________________________________________
multiply_12 (Multiply)          (None, None, 256)    0           activation_49[0][0]              
                                                                 activation_50[0][0]              
__________________________________________________________________________________________________
conv1d_51 (Conv1D)              (None, None, 256)    65792       multiply_12[0][0]                
__________________________________________________________________________________________________
batch_normalization_51 (BatchNo (None, None, 256)    1024        conv1d_51[0][0]                  
__________________________________________________________________________________________________
activation_51 (Activation)      (None, None, 256)    0           batch_normalization_51[0][0]     
__________________________________________________________________________________________________
add_12 (Add)                    (None, None, 256)    0           activation_51[0][0]              
                                                                 add_11[0][0]                     
__________________________________________________________________________________________________
conv1d_53 (Conv1D)              (None, None, 256)    459008      add_12[0][0]                     
__________________________________________________________________________________________________
conv1d_54 (Conv1D)              (None, None, 256)    459008      add_12[0][0]                     
__________________________________________________________________________________________________
batch_normalization_53 (BatchNo (None, None, 256)    1024        conv1d_53[0][0]                  
__________________________________________________________________________________________________
batch_normalization_54 (BatchNo (None, None, 256)    1024        conv1d_54[0][0]                  
__________________________________________________________________________________________________
activation_53 (Activation)      (None, None, 256)    0           batch_normalization_53[0][0]     
__________________________________________________________________________________________________
activation_54 (Activation)      (None, None, 256)    0           batch_normalization_54[0][0]     
__________________________________________________________________________________________________
multiply_13 (Multiply)          (None, None, 256)    0           activation_53[0][0]              
                                                                 activation_54[0][0]              
__________________________________________________________________________________________________
conv1d_55 (Conv1D)              (None, None, 256)    65792       multiply_13[0][0]                
__________________________________________________________________________________________________
batch_normalization_55 (BatchNo (None, None, 256)    1024        conv1d_55[0][0]                  
__________________________________________________________________________________________________
activation_55 (Activation)      (None, None, 256)    0           batch_normalization_55[0][0]     
__________________________________________________________________________________________________
add_13 (Add)                    (None, None, 256)    0           activation_55[0][0]              
                                                                 add_12[0][0]                     
__________________________________________________________________________________________________
conv1d_57 (Conv1D)              (None, None, 256)    459008      add_13[0][0]                     
__________________________________________________________________________________________________
conv1d_58 (Conv1D)              (None, None, 256)    459008      add_13[0][0]                     
__________________________________________________________________________________________________
batch_normalization_57 (BatchNo (None, None, 256)    1024        conv1d_57[0][0]                  
__________________________________________________________________________________________________
batch_normalization_58 (BatchNo (None, None, 256)    1024        conv1d_58[0][0]                  
__________________________________________________________________________________________________
activation_57 (Activation)      (None, None, 256)    0           batch_normalization_57[0][0]     
__________________________________________________________________________________________________
activation_58 (Activation)      (None, None, 256)    0           batch_normalization_58[0][0]     
__________________________________________________________________________________________________
multiply_14 (Multiply)          (None, None, 256)    0           activation_57[0][0]              
                                                                 activation_58[0][0]              
__________________________________________________________________________________________________
conv1d_4 (Conv1D)               (None, None, 256)    65792       multiply[0][0]                   
__________________________________________________________________________________________________
conv1d_8 (Conv1D)               (None, None, 256)    65792       multiply_1[0][0]                 
__________________________________________________________________________________________________
conv1d_12 (Conv1D)              (None, None, 256)    65792       multiply_2[0][0]                 
__________________________________________________________________________________________________
conv1d_16 (Conv1D)              (None, None, 256)    65792       multiply_3[0][0]                 
__________________________________________________________________________________________________
conv1d_20 (Conv1D)              (None, None, 256)    65792       multiply_4[0][0]                 
__________________________________________________________________________________________________
conv1d_24 (Conv1D)              (None, None, 256)    65792       multiply_5[0][0]                 
__________________________________________________________________________________________________
conv1d_28 (Conv1D)              (None, None, 256)    65792       multiply_6[0][0]                 
__________________________________________________________________________________________________
conv1d_32 (Conv1D)              (None, None, 256)    65792       multiply_7[0][0]                 
__________________________________________________________________________________________________
conv1d_36 (Conv1D)              (None, None, 256)    65792       multiply_8[0][0]                 
__________________________________________________________________________________________________
conv1d_40 (Conv1D)              (None, None, 256)    65792       multiply_9[0][0]                 
__________________________________________________________________________________________________
conv1d_44 (Conv1D)              (None, None, 256)    65792       multiply_10[0][0]                
__________________________________________________________________________________________________
conv1d_48 (Conv1D)              (None, None, 256)    65792       multiply_11[0][0]                
__________________________________________________________________________________________________
conv1d_52 (Conv1D)              (None, None, 256)    65792       multiply_12[0][0]                
__________________________________________________________________________________________________
conv1d_56 (Conv1D)              (None, None, 256)    65792       multiply_13[0][0]                
__________________________________________________________________________________________________
conv1d_60 (Conv1D)              (None, None, 256)    65792       multiply_14[0][0]                
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, None, 256)    1024        conv1d_4[0][0]                   
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, None, 256)    1024        conv1d_8[0][0]                   
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, None, 256)    1024        conv1d_12[0][0]                  
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, None, 256)    1024        conv1d_16[0][0]                  
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, None, 256)    1024        conv1d_20[0][0]                  
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, None, 256)    1024        conv1d_24[0][0]                  
__________________________________________________________________________________________________
batch_normalization_28 (BatchNo (None, None, 256)    1024        conv1d_28[0][0]                  
__________________________________________________________________________________________________
batch_normalization_32 (BatchNo (None, None, 256)    1024        conv1d_32[0][0]                  
__________________________________________________________________________________________________
batch_normalization_36 (BatchNo (None, None, 256)    1024        conv1d_36[0][0]                  
__________________________________________________________________________________________________
batch_normalization_40 (BatchNo (None, None, 256)    1024        conv1d_40[0][0]                  
__________________________________________________________________________________________________
batch_normalization_44 (BatchNo (None, None, 256)    1024        conv1d_44[0][0]                  
__________________________________________________________________________________________________
batch_normalization_48 (BatchNo (None, None, 256)    1024        conv1d_48[0][0]                  
__________________________________________________________________________________________________
batch_normalization_52 (BatchNo (None, None, 256)    1024        conv1d_52[0][0]                  
__________________________________________________________________________________________________
batch_normalization_56 (BatchNo (None, None, 256)    1024        conv1d_56[0][0]                  
__________________________________________________________________________________________________
batch_normalization_60 (BatchNo (None, None, 256)    1024        conv1d_60[0][0]                  
__________________________________________________________________________________________________
activation_4 (Activation)       (None, None, 256)    0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
activation_8 (Activation)       (None, None, 256)    0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
activation_12 (Activation)      (None, None, 256)    0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
activation_16 (Activation)      (None, None, 256)    0           batch_normalization_16[0][0]     
__________________________________________________________________________________________________
activation_20 (Activation)      (None, None, 256)    0           batch_normalization_20[0][0]     
__________________________________________________________________________________________________
activation_24 (Activation)      (None, None, 256)    0           batch_normalization_24[0][0]     
__________________________________________________________________________________________________
activation_28 (Activation)      (None, None, 256)    0           batch_normalization_28[0][0]     
__________________________________________________________________________________________________
activation_32 (Activation)      (None, None, 256)    0           batch_normalization_32[0][0]     
__________________________________________________________________________________________________
activation_36 (Activation)      (None, None, 256)    0           batch_normalization_36[0][0]     
__________________________________________________________________________________________________
activation_40 (Activation)      (None, None, 256)    0           batch_normalization_40[0][0]     
__________________________________________________________________________________________________
activation_44 (Activation)      (None, None, 256)    0           batch_normalization_44[0][0]     
__________________________________________________________________________________________________
activation_48 (Activation)      (None, None, 256)    0           batch_normalization_48[0][0]     
__________________________________________________________________________________________________
activation_52 (Activation)      (None, None, 256)    0           batch_normalization_52[0][0]     
__________________________________________________________________________________________________
activation_56 (Activation)      (None, None, 256)    0           batch_normalization_56[0][0]     
__________________________________________________________________________________________________
activation_60 (Activation)      (None, None, 256)    0           batch_normalization_60[0][0]     
__________________________________________________________________________________________________
add_15 (Add)                    (None, None, 256)    0           activation_4[0][0]               
                                                                 activation_8[0][0]               
                                                                 activation_12[0][0]              
                                                                 activation_16[0][0]              
                                                                 activation_20[0][0]              
                                                                 activation_24[0][0]              
                                                                 activation_28[0][0]              
                                                                 activation_32[0][0]              
                                                                 activation_36[0][0]              
                                                                 activation_40[0][0]              
                                                                 activation_44[0][0]              
                                                                 activation_48[0][0]              
                                                                 activation_52[0][0]              
                                                                 activation_56[0][0]              
                                                                 activation_60[0][0]              
__________________________________________________________________________________________________
activation_61 (Activation)      (None, None, 256)    0           add_15[0][0]                     
__________________________________________________________________________________________________
conv1d_61 (Conv1D)              (None, None, 256)    65792       activation_61[0][0]              
__________________________________________________________________________________________________
batch_normalization_61 (BatchNo (None, None, 256)    1024        conv1d_61[0][0]                  
__________________________________________________________________________________________________
activation_62 (Activation)      (None, None, 256)    0           batch_normalization_61[0][0]     
__________________________________________________________________________________________________
conv1d_62 (Conv1D)              (None, None, 54)     13878       activation_62[0][0]              
__________________________________________________________________________________________________
batch_normalization_62 (BatchNo (None, None, 54)     216         conv1d_62[0][0]                  
__________________________________________________________________________________________________
Y (InputLayer)                  [(None, None)]       0                                            
__________________________________________________________________________________________________
activation_63 (Activation)      (None, None, 54)     0           batch_normalization_62[0][0]     
__________________________________________________________________________________________________
X_length (InputLayer)           [(None, 1)]          0                                            
__________________________________________________________________________________________________
Y_length (InputLayer)           [(None, 1)]          0                                            
__________________________________________________________________________________________________
ctc (Lambda)                    (None, 1)            0           Y[0][0]                          
                                                                 activation_63[0][0]              
                                                                 X_length[0][0]                   
                                                                 Y_length[0][0]                   
==================================================================================================
Total params: 15,824,142
Trainable params: 15,792,802
Non-trainable params: 31,340
__________________________________________________________________________________________________
